HungChienSix/Renesas_SourceCode/Renesas.RA_DFP.6.4.0/SVD/R7FA0E303.svd
<?xml version="1.0" encoding="UTF-8" standalone="yes"?>
<device xs:noNamespaceSchemaLocation="CMSIS-SVD.xsd" schemaVersion="1.2" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance">
    <vendor>Renesas Electronics Corporation</vendor>
    <vendorID>Renesas</vendorID>
    <name>R7FA0E303</name>
    <series>RA0</series>
    <version>1.00.00</version>
    <description>Arm Cortex-M23 based Microcontroller RA0E3 device</description>
    <licenseText>This software is supplied by Renesas Electronics Corporation and is only intended for \n
use with Renesas products. No other uses are authorized. This software is owned by \n
Renesas Electronics Corporation and is protected under all applicable laws, including \n
copyright laws. \n
\n
THIS SOFTWARE IS PROVIDED "AS IS" AND RENESAS MAKES NO WARRANTIES REGARDING \n
THIS SOFTWARE, WHETHER EXPRESS, IMPLIED OR STATUTORY, INCLUDING BUT NOT LIMITED TO \n
WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT. \n
ALL SUCH WARRANTIES ARE EXPRESSLY DISCLAIMED. TO THE MAXIMUM EXTENT PERMITTED NOT \n
PROHIBITED BY LAW, NEITHER RENESAS ELECTRONICS CORPORATION NOR ANY OF ITS AFFILIATED \n
COMPANIES SHALL BE LIABLE FOR ANY DIRECT, INDIRECT, SPECIAL, INCIDENTAL OR CONSEQUENTIAL \n
DAMAGES FOR ANY REASON RELATED TO THIS SOFTWARE, EVEN IF RENESAS OR ITS AFFILIATES HAVE \n
BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES. \n
\n
Renesas reserves the right, without notice, to make changes to this software and to \n
discontinue the availability of this software. By using this software, you agree to \n
the additional terms and conditions found by accessing the following link: \n
http://www.renesas.com/disclaimer \n
\n</licenseText>
    <cpu>
        <name>CM23</name>
        <revision>r1p0</revision>
        <endian>little</endian>
        <mpuPresent>false</mpuPresent>
        <fpuPresent>false</fpuPresent>
        <vtorPresent>true</vtorPresent>
        <nvicPrioBits>2</nvicPrioBits>
        <vendorSystickConfig>false</vendorSystickConfig>
        <deviceNumInterrupts>64</deviceNumInterrupts>
    </cpu>
    <headerSystemFilename>system_RA0E3</headerSystemFilename>
    <headerDefinitionsPrefix>R_</headerDefinitionsPrefix>
    <addressUnitBits>8</addressUnitBits>
    <width>32</width>
    <size>32</size>
    <access>read-write</access>
    <protection>n</protection>
    <resetValue>0</resetValue>
    <resetMask>0xFFFFFFFF</resetMask>
    <peripherals>
        <peripheral>
            <name>BUS</name>
            <description>BUS Control</description>
            <baseAddress>0x40003000</baseAddress>
            <addressBlock>
                <offset>0x1008</offset>
                <size>2</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x100C</offset>
                <size>2</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x1820</offset>
                <size>5</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x1830</offset>
                <size>5</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>BUSMCNTSYS</name>
                    <description>Master Bus Control Register SYS</description>
                    <addressOffset>0x1008</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>IERES</name>
                            <description>Ignore Error Responses</description>
                            <lsb>15</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>A bus error is reported.</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>A bus error is not reported.</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>BUSMCNTDMA</name>
                    <description>Master Bus Control Register DMA</description>
                    <addressOffset>0x100C</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>IERES</name>
                            <description>Ignore Error Responses</description>
                            <lsb>15</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>A bus error is reported.</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>A bus error is not reported.</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>BUS3ERRADD</name>
                    <description>Bus Error Address Register 3</description>
                    <addressOffset>0x1820</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x00000000</resetMask>
                    <fields>
                        <field>
                            <name>BERAD</name>
                            <description>Bus Error Address</description>
                            <lsb>0</lsb>
                            <msb>31</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>BUS3ERRSTAT</name>
                    <description>BUS Error Status Register 3</description>
                    <addressOffset>0x1824</addressOffset>
                    <size>8</size>
                    <access>read-only</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFE</resetMask>
                    <fields>
                        <field>
                            <name>ACCSTAT</name>
                            <description>Error Access Status flag</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Read access</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Write access</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>ERRSTAT</name>
                            <description>Bus Error Status flag</description>
                            <lsb>7</lsb>
                            <msb>7</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>No bus error occurred.</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Bus error occurred.</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>BUS4ERRADD</name>
                    <description>Bus Error Address Register 4</description>
                    <addressOffset>0x1830</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x00000000</resetMask>
                    <fields>
                        <field>
                            <name>BERAD</name>
                            <description>Bus Error Address</description>
                            <lsb>0</lsb>
                            <msb>31</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>BUS4ERRSTAT</name>
                    <description>BUS Error Status Register 4</description>
                    <addressOffset>0x1834</addressOffset>
                    <size>8</size>
                    <access>read-only</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFE</resetMask>
                    <fields>
                        <field>
                            <name>ACCSTAT</name>
                            <description>Error Access Status flag</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Read access</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Write access</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>ERRSTAT</name>
                            <description>Bus Error Status flag</description>
                            <lsb>7</lsb>
                            <msb>7</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>No bus error occurred.</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Bus error occurred.</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
